KingKoro/CH32VX-PWM-PIO-Library/lib/CH32V_PWM/ch32v_pwm.c
    if (object->pwm_mode == PWM_MODE1)
    {
        TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
    }
    else
    {
        TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
    }
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Disable;       // Ensure PWM-Output is turned off
	TIM_OCInitStructure.TIM_Pulse = object->duty_cycle;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    // ---------- Configure Timer and Channel ----------
    // This extensive selection matrix, should get optimized to few statements by compiler
    switch (object->timer)
    {
        case PWM_TIM1:
            switch (object->channel)
            {
                case PWM_CH1:
                    TIM_OC1Init( TIM1, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM1, ENABLE );
                    TIM_OC1PreloadConfig( TIM1, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM1, ENABLE );
                    break;
                case PWM_CH2:
                    TIM_OC2Init( TIM1, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM1, ENABLE );
                    TIM_OC2PreloadConfig( TIM1, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM1, ENABLE );
                    break;
                case PWM_CH3:
                    TIM_OC3Init( TIM1, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM1, ENABLE );
                    TIM_OC3PreloadConfig( TIM1, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM1, ENABLE );
                    break;
                case PWM_CH4:
                    TIM_OC4Init( TIM1, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM1, ENABLE );
                    TIM_OC4PreloadConfig( TIM1, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM1, ENABLE );
                    break;
            }
            break;
        case PWM_TIM2:
            switch (object->channel)
            {
                case PWM_CH1:
                    TIM_OC1Init( TIM2, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM2, ENABLE );
                    TIM_OC1PreloadConfig( TIM2, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM2, ENABLE );
                    break;
                case PWM_CH2:
                    TIM_OC2Init( TIM2, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM2, ENABLE );
                    TIM_OC2PreloadConfig( TIM2, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM2, ENABLE );
                    break;
                case PWM_CH3:
                    TIM_OC3Init( TIM2, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM2, ENABLE );
                    TIM_OC3PreloadConfig( TIM2, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM2, ENABLE );
                    break;
                case PWM_CH4:
                    TIM_OC4Init( TIM2, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM2, ENABLE );
                    TIM_OC4PreloadConfig( TIM2, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM2, ENABLE );
                    break;
            }
            break;
        case PWM_TIM3:
            switch (object->channel)
            {
                case PWM_CH1:
                    TIM_OC1Init( TIM3, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM3, ENABLE );
                    TIM_OC1PreloadConfig( TIM3, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM3, ENABLE );
                    break;
                case PWM_CH2:
                    TIM_OC2Init( TIM3, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM3, ENABLE );
                    TIM_OC2PreloadConfig( TIM3, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM3, ENABLE );
                    break;
                case PWM_CH3:
                    TIM_OC3Init( TIM3, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM3, ENABLE );
                    TIM_OC3PreloadConfig( TIM3, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM3, ENABLE );
                    break;
                case PWM_CH4:
                    TIM_OC4Init( TIM3, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM3, ENABLE );
                    TIM_OC4PreloadConfig( TIM3, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM3, ENABLE );
                    break;
            }
            break;
        #if !defined(CH32X035) && !defined(CH32X033)
        case PWM_TIM4:
            switch (object->channel)
            {
                case PWM_CH1:
                    TIM_OC1Init( TIM4, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM4, ENABLE );
                    TIM_OC1PreloadConfig( TIM4, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM4, ENABLE );
                    break;
                case PWM_CH2:
                    TIM_OC2Init( TIM4, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM4, ENABLE );
                    TIM_OC2PreloadConfig( TIM4, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM4, ENABLE );
                    break;
                case PWM_CH3:
                    TIM_OC3Init( TIM4, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM4, ENABLE );
                    TIM_OC3PreloadConfig( TIM4, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM4, ENABLE );
                    break;
                case PWM_CH4:
                    TIM_OC4Init( TIM4, &TIM_OCInitStructure );
                    TIM_CtrlPWMOutputs( TIM4, ENABLE );
                    TIM_OC4PreloadConfig( TIM4, TIM_OCPreload_Disable );
                    TIM_ARRPreloadConfig( TIM4, ENABLE );
                    break;
            }
            break;
        #endif
    }
}